app/views/movies/show.html.erb

  <h2> Trusted Reviews </h2>
  <% @movie.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 1]]