app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
---

    <% @user.reviews.each do |review|%>

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
---
     <p>Review: <%=  review.body %></p>
    <p><% review.comments.each do |comment| %></p>