app/controllers/reviews_controller.rb

 def create
    review = Review.new(review_params)
      review.vote_count = 0
      review.user_id = session[:user_id]
    if review.save
---
INSERT INTO "reviews" ("title", "body", "rating", "vote_count", "movie_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"