app/controllers/searches_controller.rb

  def index
    @search_text = search_params[:title]
    @movies = Movie.where("title LIKE :search", search: "#{@search_text}%")
    if @movies.empty?
      result = OMDB.title(@search_text)
      @movie = Movie.create(title: result.title, genre: result.genre, year: result.year, synopsis: result.plot, poster: result.poster )
---
SELECT "movies".* FROM "movies" WHERE (lower(title) LIKE '%grand b%')
SELECT COUNT(*) FROM "movies" WHERE (lower(title) LIKE '%%')
INSERT INTO "movies" ("title", "genre", "year", "synopsis", "poster", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"