app/views/layouts/_navigation.html.erb

SELECT "genres".* FROM "genres"
---
        <input class="font-s-16 padding-12-20 no-border" type="text" placeholder="Search.." id="myInput" onkeyup="filterFunction()">
        <% Genre.all.each do |genre| %>